In [12]:
import numpy as np
import pandas as pd
from numpy.random import randn
ser1=pd.Series([1,2,3,4],index=['usa','america','germany','ussr'])
print(ser1)

usa        1
america    2
germany    3
ussr       4
dtype: int64

In [13]:
ser2=pd.Series([1,2,3,4,5],index=['usa','america','germany','ussr','india'])
ser1+ser2

america    4.0
germany    6.0
india      NaN
usa        2.0
ussr       8.0
dtype: float64

In [18]:
from numpy.random import randn
np.random.seed(101)

In [40]:
df=pd.DataFrame(randn(5,4),index=('A B C D E').split(),columns=('W X Y Z').split())
print(df)

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [41]:
df['new']=df['W']+df['Z']
print(df['new'])

A    0.616367
B    2.621142
C   -1.738032
D   -3.524132
E    2.285338
Name: new, dtype: float64

In [42]:
df['sal']=df['W']*10
print(df['sal'])

A     3.860303
B     6.812093
C   -10.051869
D   -13.829201
E     9.925735
Name: sal, dtype: float64

In [38]:
print(df.drop('sal',axis=1))

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [43]:
print(df)

          W         X         Y         Z       new        sal
A  0.386030  2.084019 -0.376519  0.230336  0.616367   3.860303
B  0.681209  1.035125 -0.031160  1.939932  2.621142   6.812093
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032 -10.051869
D -1.382920  1.482495  0.961458 -2.141212 -3.524132 -13.829201
E  0.992573  1.192241 -1.046780  1.292765  2.285338   9.925735

In [45]:
df.drop('E',axis=0)

          W         X         Y         Z       new        sal
A  0.386030  2.084019 -0.376519  0.230336  0.616367   3.860303
B  0.681209  1.035125 -0.031160  1.939932  2.621142   6.812093
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032 -10.051869
D -1.382920  1.482495  0.961458 -2.141212 -3.524132 -13.829201

In [50]:
df.loc['A']

W      0.386030
X      2.084019
Y     -0.376519
Z      0.230336
new    0.616367
sal    3.860303
Name: A, dtype: float64

In [51]:
df.loc['A','Y']

-0.37651867524923904

In [53]:
df.loc[['A','B'],['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932

In [54]:
df.loc[['A','B']]

          W         X         Y         Z       new       sal
A  0.386030  2.084019 -0.376519  0.230336  0.616367  3.860303
B  0.681209  1.035125 -0.031160  1.939932  2.621142  6.812093

In [55]:
df.loc[['A','B'],['Y']]

          Y
A -0.376519
B -0.031160

In [63]:
df.iloc[:3]

          W         X         Y         Z       new        sal
A  0.386030  2.084019 -0.376519  0.230336  0.616367   3.860303
B  0.681209  1.035125 -0.031160  1.939932  2.621142   6.812093
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032 -10.051869

In [64]:
df>0

       W      X      Y      Z    new    sal
A   True   True  False   True   True   True
B   True   True  False   True   True   True
C  False  False   True  False  False  False
D  False   True   True  False  False  False
E   True   True  False   True   True   True

In [66]:
df[df>0]

          W         X         Y         Z       new       sal
A  0.386030  2.084019       NaN  0.230336  0.616367  3.860303
B  0.681209  1.035125       NaN  1.939932  2.621142  6.812093
C       NaN       NaN  0.187125       NaN       NaN       NaN
D       NaN  1.482495  0.961458       NaN       NaN       NaN
E  0.992573  1.192241       NaN  1.292765  2.285338  9.925735

In [67]:
df[df<0]

          W        X         Y         Z       new        sal
A       NaN      NaN -0.376519       NaN       NaN        NaN
B       NaN      NaN -0.031160       NaN       NaN        NaN
C -1.005187 -0.74179       NaN -0.732845 -1.738032 -10.051869
D -1.382920      NaN       NaN -2.141212 -3.524132 -13.829201
E       NaN      NaN -1.046780       NaN       NaN        NaN

In [68]:
df[df['W']>0]

          W         X         Y         Z       new       sal
A  0.386030  2.084019 -0.376519  0.230336  0.616367  3.860303
B  0.681209  1.035125 -0.031160  1.939932  2.621142  6.812093
E  0.992573  1.192241 -1.046780  1.292765  2.285338  9.925735

In [78]:
df[df['W']<0]['Y']

C    0.187125
D    0.961458
Name: Y, dtype: float64

In [82]:
df[(df['W']<0) & (df['Y']<1)]

          W         X         Y         Z       new        sal
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032 -10.051869
D -1.382920  1.482495  0.961458 -2.141212 -3.524132 -13.829201

In [83]:
df[(df['W']<0) | (df['Y']<1)]

          W         X         Y         Z       new        sal
A  0.386030  2.084019 -0.376519  0.230336  0.616367   3.860303
B  0.681209  1.035125 -0.031160  1.939932  2.621142   6.812093
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032 -10.051869
D -1.382920  1.482495  0.961458 -2.141212 -3.524132 -13.829201
E  0.992573  1.192241 -1.046780  1.292765  2.285338   9.925735

In [86]:
n='CA NY RA IND UK'.split()
df['statecodes']=n
print(df)
df.reset_index()

          W         X         Y         Z       new        sal statecodes
A  0.386030  2.084019 -0.376519  0.230336  0.616367   3.860303         CA
B  0.681209  1.035125 -0.031160  1.939932  2.621142   6.812093         NY
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032 -10.051869         RA
D -1.382920  1.482495  0.961458 -2.141212 -3.524132 -13.829201        IND
E  0.992573  1.192241 -1.046780  1.292765  2.285338   9.925735         UK

,index,W,X,Y,Z,new,sal,statecodes
0,A,0.386030,2.084019,-0.376519,0.230336,0.616367,3.860303,CA
1,B,0.681209,1.035125,-0.031160,1.939932,2.621142,6.812093,NY
2,C,-1.005187,-0.741790,0.187125,-0.732845,-1.738032,-10.051869,RA
3,D,-1.382920,1.482495,0.961458,-2.141212,-3.524132,-13.829201,IND
4,E,0.992573,1.192241,-1.046780,1.292765,2.285338,9.925735,UK

In [87]:
df.set_index("Z")

                  W         X         Y       new        sal statecodes
Z
 0.230336  0.386030  2.084019 -0.376519  0.616367   3.860303         CA
 1.939932  0.681209  1.035125 -0.031160  2.621142   6.812093         NY
-0.732845 -1.005187 -0.741790  0.187125 -1.738032 -10.051869         RA
-2.141212 -1.382920  1.482495  0.961458 -3.524132 -13.829201        IND
 1.292765  0.992573  1.192241 -1.046780  2.285338   9.925735         UK

In [92]:
df.set_index(["statecodes","Z"])

                             W         X         Y       new        sal
statecodes Z
CA          0.230336  0.386030  2.084019 -0.376519  0.616367   3.860303
NY          1.939932  0.681209  1.035125 -0.031160  2.621142   6.812093
RA         -0.732845 -1.005187 -0.741790  0.187125 -1.738032 -10.051869
IND        -2.141212 -1.382920  1.482495  0.961458 -3.524132 -13.829201
UK          1.292765  0.992573  1.192241 -1.046780  2.285338   9.925735